# macOS Brewfile - Cleaned for Python/ML Development

# ===========================================
# Core Development Tools
# ===========================================
brew "git"
brew "curl"
brew "wget"
brew "gnupg"
brew "pass"
brew "pinentry-mac"

# ===========================================
# Shell & Terminal
# ===========================================
brew "fish"
brew "fish-lsp"
brew "fisher"
brew "starship"
brew "tmux"
brew "zellij"

# ===========================================
# Modern CLI Tools
# ===========================================
brew "bat"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "eza"
brew "zoxide"
brew "direnv"
brew "jq"
brew "tldr"
brew "watch"

# ===========================================
# Editors
# ===========================================
brew "neovim"
brew "helix"
brew "vim"

# ===========================================
# Git Tools
# ===========================================
brew "git-delta"
brew "lazygit"

# ===========================================
# Python Development
# ===========================================
brew "pyenv"
brew "pyenv-virtualenv"
brew "uv"
brew "pyright"
brew "python-lsp-server"
brew "pylyzer"
brew "black"
brew "ruff"

# ===========================================
# Node.js Development
# ===========================================
brew "fnm"
brew "typescript-language-server"
brew "prettier"
brew "biome"

# ===========================================
# Go Development
# ===========================================
brew "go"
brew "golines"

# ===========================================
# Containers & Docker
# ===========================================
brew "colima", restart_service: :changed
brew "docker"
brew "docker-compose"
brew "dockerfile-language-server"

# ===========================================
# AI & ML Tools
# ===========================================
brew "ollama", restart_service: :changed
brew "pytorch"
brew "gemini-cli"

# ===========================================
# System Monitoring & Performance
# ===========================================
brew "htop"
brew "btop"
brew "glances"
brew "fastfetch"
brew "terminal-notifier"

# ===========================================
# Network Tools
# ===========================================
brew "httpie"

# ===========================================
# LSP Servers & Language Tools
# ===========================================
brew "bash-language-server"
brew "yaml-language-server"
brew "vscode-langservers-extracted"
brew "tree-sitter-cli"

# ===========================================
# Formatters & Linters
# ===========================================
brew "shfmt"
brew "taplo"

# ===========================================
# File Tools
# ===========================================
brew "sevenzip"
brew "rclone"
brew "rdiff-backup"
brew "yazi"

# ===========================================
# Build Tools
# ===========================================
brew "chezmoi"
brew "pre-commit"
brew "ninja"
brew "pkgconf"
brew "libtool"

# ===========================================
# Misc Utilities
# ===========================================
brew "imagemagick"
brew "ffmpeg"
brew "ghostscript"
brew "tectonic"