tap "databricks/tap"
tap "hashicorp/tap"
tap "homebrew/command-not-found"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
brew "git"
brew "asdf"
brew "ast-grep"
brew "aws-cdk"
brew "aws-sam-cli"
brew "awscli"
brew "azure-cli"
brew "bash-language-server"
brew "bat"
brew "biome"
brew "black"
brew "btop"
brew "certbot"
brew "cfn-lint"
brew "chezmoi"
brew "colima", restart_service: :changed
brew "curl"
brew "libtool"
brew "php"
brew "composer"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dockerfile-language-server"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fio"
brew "fish"
brew "fish-lsp"
brew "fisher"
brew "fnm"
brew "fzf"
brew "gemini-cli"
brew "ghostscript"
brew "git-delta"
brew "glances"
brew "gnupg"
brew "go"
brew "golines"
brew "terminal-notifier"
brew "gopass"
brew "graphviz"
brew "pkgconf"
brew "helix"
brew "helm"
brew "htop"
brew "httpie"
brew "ifstat"
brew "imagemagick"
brew "imagesnap"
brew "joplin-cli"
brew "jq"
brew "julia"
brew "kanata"
brew "kind"
brew "kubernetes-cli"
brew "lazygit"
brew "lolcat"
brew "luarocks"
brew "mermaid-cli"
brew "minikube"
brew "mise"
brew "neovim"
brew "neovide"
brew "ninja"
brew "nnn"
brew "nvm"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "pass"
brew "pinentry-mac"
brew "pipx"
brew "plantuml"
brew "poetry"
brew "pre-commit"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pylyzer"
brew "pyright"
brew "python-lsp-server"
brew "pytorch"
brew "rbenv"
brew "rclone"
brew "rdiff-backup"
brew "ripgrep"
brew "ruff"
brew "rust-analyzer"
brew "rustup"
brew "sevenzip"
brew "shfmt"
brew "showkey"
brew "sql-formatter"
brew "sql-language-server"
brew "sqlfmt"
brew "starship"
brew "structurizr-cli"
brew "switchaudio-osx"
brew "taplo"
brew "tectonic"
brew "terraform-ls"
brew "tfsec"
brew "tldr"
brew "tmux"
brew "tree-sitter-cli"
brew "typescript-language-server"
brew "uv"
brew "vim"
brew "vscode-langservers-extracted"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "databricks/tap/databricks"
brew "hashicorp/tap/terraform"
cask "aerospace"
cask "alacritty"
cask "amethyst"
cask "arc"
cask "bitwarden"
cask "coteditor"
cask "dbeaver-community"
cask "drawio"
cask "font-caskaydia-cove-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "geekbench"
cask "gimp"
cask "git-credential-manager"
cask "iterm2"
cask "joplin"
cask "kitty"
cask "librewolf"
cask "mac-mouse-fix"
cask "meld"
cask "openscad"
cask "shottr"
cask "vscodium"
